; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v5 - type_3 ?v3 - type_2)
 	      (pred_1 ?v1 - object ?v3 - type_2)
	      (pred_3 ?v5 - type_3 ?v8 - type_1)
	      (pred_2 ?v5 - type_3 ?v1 - object ?v8 - type_1))

   (:action op_2
       :parameters  (?v5 - type_3 ?v7 ?v2 - type_2)
       :precondition (and  (pred_4 ?v5 ?v7))
       :effect (and  (pred_4 ?v5 ?v2)
		     (not (pred_4 ?v5 ?v7))))

   (:action op_1
       :parameters (?v5 - type_3 ?v4 - object ?v6 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v4 ?v6) (pred_4 ?v5 ?v6) (pred_3 ?v5 ?v8))
       :effect (and (pred_2 ?v5 ?v4 ?v8)
		    (not (pred_1 ?v4 ?v6)) 
		    (not (pred_3 ?v5 ?v8))))

   (:action op_3
       :parameters (?v5 - type_3 ?v4 - object ?v6 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v4 ?v8) (pred_4 ?v5 ?v6))
       :effect (and (pred_1 ?v4 ?v6)
		    (pred_3 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v4 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_13 - type_3
obj_12 obj_04 obj_01 obj_05 - type_1
obj_02 obj_09 obj_10 obj_06 - type_2
obj_08 obj_14 obj_11 obj_03 - object)
(:init
(pred_4 obj_07 obj_10)
(pred_3 obj_07 obj_12)
(pred_3 obj_07 obj_04)
(pred_4 obj_13 obj_09)
(pred_3 obj_13 obj_01)
(pred_3 obj_13 obj_05)
(pred_1 obj_08 obj_06)
(pred_1 obj_14 obj_02)
(pred_1 obj_11 obj_10)
(pred_1 obj_03 obj_06)
)
(:goal
(and
(pred_1 obj_08 obj_02)
(pred_1 obj_14 obj_10)
(pred_1 obj_11 obj_10)
(pred_1 obj_03 obj_10)
)
)

(:constraints
  (always (not (pred_4 obj_07 obj_06)))
)
)

; plan
1. (op_2 obj_07 obj_10 obj_02)
   deleted: (pred_4 obj_07 obj_10)
   added: (pred_4 obj_07 obj_02)
   goals met: 1 of 4
2. (op_2 obj_13 obj_09 obj_10)
   deleted: (pred_4 obj_13 obj_09)
   added: (pred_4 obj_13 obj_10)
   goals met: 1 of 4
3. (op_1 obj_07 obj_14 obj_02 obj_04)
   deleted: (pred_1 obj_14 obj_02) (pred_3 obj_07 obj_04)
   added: (pred_2 obj_07 obj_14 obj_04)
   goals met: 1 of 4
4. (op_2 obj_13 obj_10 obj_06)
   deleted: (pred_4 obj_13 obj_10)
   added: (pred_4 obj_13 obj_06)
   goals met: 1 of 4
5. (op_2 obj_07 obj_02 obj_10)
   deleted: (pred_4 obj_07 obj_02)
   added: (pred_4 obj_07 obj_10)
   goals met: 1 of 4
6. (op_1 obj_13 obj_03 obj_06 obj_05)
   deleted: (pred_1 obj_03 obj_06) (pred_3 obj_13 obj_05)
   added: (pred_2 obj_13 obj_03 obj_05)
   goals met: 1 of 4
7. (op_1 obj_13 obj_08 obj_06 obj_01)
   deleted: (pred_1 obj_08 obj_06) (pred_3 obj_13 obj_01)
   added: (pred_2 obj_13 obj_08 obj_01)
   goals met: 1 of 4
8. (op_3 obj_07 obj_14 obj_10 obj_04)
   deleted: (pred_2 obj_07 obj_14 obj_04)
   added: (pred_1 obj_14 obj_10) (pred_3 obj_07 obj_04)
   goals met: 2 of 4
9. (op_2 obj_13 obj_06 obj_10)
   deleted: (pred_4 obj_13 obj_06)
   added: (pred_4 obj_13 obj_10)
   goals met: 2 of 4
10. (op_3 obj_13 obj_03 obj_10 obj_05)
   deleted: (pred_2 obj_13 obj_03 obj_05)
   added: (pred_1 obj_03 obj_10) (pred_3 obj_13 obj_05)
   goals met: 3 of 4
11. (op_2 obj_13 obj_10 obj_02)
   deleted: (pred_4 obj_13 obj_10)
   added: (pred_4 obj_13 obj_02)
   goals met: 3 of 4
12. (op_3 obj_13 obj_08 obj_02 obj_01)
   deleted: (pred_2 obj_13 obj_08 obj_01)
   added: (pred_1 obj_08 obj_02) (pred_3 obj_13 obj_01)
   goals met: 4 of 4
